import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'our-services',
  templateUrl: './our-services.component.html',
  styleUrls: ['./our-services.component.css']
})
export class OurServicesComponent implements OnInit {
  slides = [
    {img: "./../../../assets/images/cars.png", title: "تصميم موقع شركة"},
    {img: "./../../../assets/images/decor.png", title: "تصميم موقع اثاث"},
    {img: "./../../../assets/images/furinture.png", title: "نظام ادارة المعارض والمناديب"},
    {img: "./../../../assets/images/law.png", title: "عرض تصميم موقع محاماة"},
    {img: "./../../../assets/images/medical.png", title: "تصميم موقع طبي او مستشفى"},
    {img: "./../../../assets/images/school.png", title: "تصميم موقع مدرسة او اكاديمية"}
  ];

  offers = [
    {title: "عرض تصميم موقع شركة", img: "./../../../assets/images/tabletcar.png", desc: "اذا لديك شركة فأنت بالطبع تحتاج الى موقع الكتروني لتطوير اعمالك وتتابع الحجوزات الخاصة بالعروض والارتقاء بمستوى شركتك, تحتاج الى موقع بتصميم احترافي يبهر الزائر عند الدخول اليه ويعكس مدى احترافية هذه الشركة, وبالتالي تترك الفرصة لموقعك ان يسوق لك خدماتك دون اى مجهود منك, فأننا نوفر لك عرض تصميم موقع , ونتفهم جيدا متطلباتك ومتطلبات زوارك وعملاءك في هذا الموقع,"},
    {title: "عرض تصميم موقع اثاث", img: "./../../../assets/images/tabletdecor.png", desc: "هل لديك حلم امتلاك شركة تجني لك الملايين وتجعلك من كبار رجال الاعمال مع شركة كزدس رزتس سنحقق لك الحلم حيث اننا متخصصون في برمجةالمواقع الشبكي بجميع انواعه"},
    {title: "عرض نظام لادارة المعارض والمانديب", img: "./../../../assets/images/tabletfurnutire.png", desc: "نقدم لك نظام متكامل لادارة معرضك ومناديبك ونقاط التوزيع الخاصه بك مع تحديد اماكن المنايب ومعرفة الحسابات الخاص بالمعرض خاصتك وتحديد مبيعاتك اليوميه والاسبوعية والشهرية وتحديد افضل العملاء لديك وافضل المناديب كما نحدد لك المكاسب والخسائر المحققة من المبيعات لكل"},
    {title: "عرض تصميم موقع محاماة", img: "./../../../assets/images/tabletlaw.png", desc: "اذا كان لديك شركة او مكتب يقدم خدمات خاصة او استشارات, اذا كنت محامي او مهندس او محاسب قانوني … الخ, ولديك مكتب خاص وتريد موقع بسيط يعرض خدماتك او منتجاتك ويوسع من قاعدة عملائك وزيادة ارباحك, ويعرض معلومات وبيانات الاتصال بشركتك او مكتبك, ويستطيع الزوار ان يتصلو بك ويتواصلو معك من خلال الموقع, اذا تريد موقع الكتروني يساهم في زيادة عدد العملاء لديك, فأننا نقدم لك عرض تصميم موقع شركة, لنساهم في تطوير اعمالك واضافة المزيد من النجاح الى عملك"},
    {title: "عرض تصميم موقع طبي او مستشفى", img: "./../../../assets/images/tabletdoctor.png", desc: "اذا كان لديك مستشفى او احد المراكز الطبية العامة او المتخصصة او عيادة , وتريد انشاء موقع الكتروني يعرض الخدمات الطبية التي تقدمها, ويعرض ايضا المميزات الطبية التي توفرها, ويعرض جيدا وبوضوح وبالصور الاقسام الموجودة داخل المستشفى او المركز الطبي التابع لك, واذا كنت تريد ايضا ان يقوم الزوار بعمل الحجوزات الطبية من خلال موقع المستشفى او المركز الطبي, فأننا نقدم لك عرض تصميم موقع مستشفى, حيث نساهم معك في تطوير ادارتك للمستشفى او المركز الطبي الخاص بك او العيادة الخاصة بك "},
    {title: "عرض تصميم موقع مدرسة او اكاديمية", img: "./../../../assets/images/tabletschool.png", desc: "اذا لديك مدرسة او جامعة او معهد تعليمي او اكاديمية وتريد ان ترتقي بالعملية التعليمية واستخدام احدث الوسائل والتقنيات في التواصل مع الطلاب واولياء الامور ليضيف اليك ميزة تنافسية بين المدارس او المعاهد التعليمية الاخرى, ولذلك تفكر في عمل موقع يكون بمثابة الوجهة الرئيسية للمدرسة على الانترنت, مما يساهم في تطوير اداء المدرسة ويجعلها تواكب التطور التكنولوجي, فأننا نقدم لك عرض تصميم مدرسة, لنوفر لك الحلول التقنية لتطوير اداء ادارة المدرسة او الجامعة او المعهد او الاكاديمية"},
  ];

  slideConfig = {
    speed: 300,
    dots: false,
    infinite: true,
    slidesToShow: 4,
    slidesToScroll: 1,
    asNavFor: '.carousel-desc',
    responsive: [
      {
        breakpoint: 1024,
        settings: {
          slidesToShow: 3,
          slidesToScroll: 3,
          infinite: true,
          dots: true
        }
      },
      {
        breakpoint: 600,
        settings: {
          slidesToShow: 2,
          slidesToScroll: 2
        }
      },
      {
        breakpoint: 480,
        settings: {
          slidesToShow: 1,
          slidesToScroll: 1
        }
      }
    ]    
  };

  slideConfigDesc = {
    speed: 300,
    dots: false,
    infinite: true,
    slidesToShow: 1,
    asNavFor: '.carousel',
    arrows: false
  };  
  constructor() { }

  ngOnInit(): void {
  }

}
